app/models/user.rb

  def self.find_for_oauth(auth)

    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `uid`, `provider`, `username`) VALUES ('10217513829619290-facebook@example.com', '$2a$11$c.0bvT4cj7WQS97ap1YqResY3HMe5iJjwU.u80dg7ygHTwQuF2FDm', '2018-12-12 08:18:32', '2018-12-12 08:18:32', '10217513829619290', 'facebook', 'Yasuhito Miyazaki')
SELECT  `users`.* FROM `users` WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '10217513829619290' ORDER BY `users`.`id` ASC LIMIT 1